NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l05/nrf54l05_flpr.svd
          <register>
            <name>HARTINFO</name>
            <description>Hart Information</description>
            <addressOffset>0x48</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATAADDR</name>
                <description>Data Address</description>
                <lsb>0</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DATASIZE</name>
                <description>Data Size</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DATAACCESS</name>
                <description>Data Access</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>The data registers are shadowed in the hart
          by CSRs. Each CSR is DXLEN bits in size, and
          corresponds to a single argument.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>The data registers are shadowed in the hart's
          memory map. Each register takes up 4 bytes in
          the memory map.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NSCRATCH</name>
                <description>Number of dscratch registers</description>
                <lsb>20</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HALTSUM1</name>
            <description>Halt Summary 1</description>
            <addressOffset>0x4C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HALTSUM1</name>
                <description>Halt Summary 1</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HAWINDOWSEL</name>
            <description>Hart Array Window Select</description>
            <addressOffset>0x50</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HAWINDOWSEL</name>
                <description>The high bits of this field may be tied to 0, depending on how large the array mask register is.
          E.g. on a system with 48 harts only bit 0 of this field may actually be writable.</description>
                <lsb>0</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HAWINDOW</name>
            <description>Hart Array Window</description>
            <addressOffset>0x54</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MASKDATA</name>
                <description>Mask data.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ABSTRACTCS</name>
            <description>Abstract Control and Status</description>
            <addressOffset>0x58</addressOffset>
            <access>read-write</access>
            <resetValue>0x01000002</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATACOUNT</name>
                <description>Number of data registers that are implemented as part of the abstract command interface. Valid sizes are 1..12.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CMDERR</name>
                <description>Command error when the abstract command fails.</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoError</name>
                    <description>No error.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>An abstract command was executing while command,
                abstractcs, or abstractauto was written, or when one of the data or progbuf registers was read
                or written. This status is only written if cmderr contains 0</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotSupported</name>
                    <description>The requested command is notsupported,
                regardless of whether the hart is running or not.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Exception</name>
                    <description>An exception occurred while executing the
                command  (e.g. while executing theProgram Buffer).</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HaltResume</name>
                    <description>The abstract command couldn't execute
                because the hart wasn't in the required state (running/halted). or unavailable.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Bus</name>
                    <description>The abstract command failed due to abus
                error (e.g. alignment, access size, or timeout).</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Other</name>
                    <description>The command failed for another reason.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BUSY</name>
                <description>Abstract command execution status.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotBusy</name>
                    <description>Not busy.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>An abstract command is currently being executed.
            This bit is set as soon as command is written, and is not cleared until that command has completed.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PROGBUFSIZE</name>
                <description>Size of the Program Buffer, in 32-bit words. Valid sizes are 0 - 1.</description>
                <lsb>24</lsb>
                <msb>28</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ABSTRACTCMD</name>
            <description>Abstract command</description>
            <addressOffset>0x5C</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONTROL</name>
                <description>This Field is interpreted in a command specific manner, described for each abstract command.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>CMDTYPE</name>
                <description>The type determines the overall functionality of this abstract command.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>REGACCESS</name>
                    <description>Register Access Command</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MEMACCESS</name>
                    <description>Memory Access Command</description>
                    <value>0x02</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ABSTRACTAUTO</name>
            <description>Abstract Command Autoexec</description>
            <addressOffset>0x60</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AUTOEXECDATA</name>
                <description>When a bit in this field is 1, read or write accesses to the corresponding data word cause the
          command in command to be executed again.</description>
                <lsb>0</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>AUTOEXECPROGBUF</name>
                <description>When a bit in this field is 1, read or write accesses to the corresponding progbuf word cause
          the command in command to be executed again.</description>
                <lsb>16</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>CONFSTRPTR[%s]</name>
            <description>Description collection: Configuration String Pointer [n]</description>
            <addressOffset>0x64</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Address</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>NEXTDM</name>
            <description>Next Debug Module</description>
            <addressOffset>0x74</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Address</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x10</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PROGBUF[%s]</name>
            <description>Description collection: Program Buffer [n]</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTHDATA</name>
            <description>Authentication Data</description>
            <addressOffset>0xC0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HALTSUM2</name>
            <description>Halt Summary 2</description>
            <addressOffset>0xD0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HALTSUM2</name>
                <description>Halt Summary 2</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HALTSUM3</name>
            <description>Halt Summary 3</description>
            <addressOffset>0xD4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HALTSUM3</name>
                <description>Halt Summary 3</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SBADDRESS3</name>
            <description>System Bus Addres 127:96</description>
            <addressOffset>0xDC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Accesses bits 127:96 of the physical address in
          sbaddress (if the system address bus is that
          wide).</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
